{
  "last_updated": "2026-02-08 13:19:22",
  "journals": [
    {
      "name": "Remote Sensing of Environment",
      "url": "https://www.sciencedirect.com/journal/remote-sensing-of-environment/about/call-for-papers",
      "image": "assets/images/rse.jpg",
      "special_issues": [
        {
          "title": "Geospatial Foundation Models for Advancing Remote Sensing of Environment",
          "url": "https://www.sciencedirect.com/special-issue/330054/geospatial-foundation-models-for-advancing-remote-sensing-of-environment",
          "deadline": "30 June 2026",
          "guest_editors": "Le Wang<br>Sujit Roy<br>Fuxun Yu<br>Qiusheng Wu<br>Chunyuan Diao",
          "description": "<p>AI-driven geospatial foundation models mark a paradigm shift in remote sensing. This special issue aims to serve as a landmark collection highlighting the convergence of AI, remote sensing, and environmental monitoring. It showcases cutting-edge methods for detecting, attributing, and forecasting natural and social environmental change; evaluates the generalization, interpretability, and transferability of foundation models across diverse sensors and landscapes; promotes open and reproducible, cloud-native Earth observation workflows; and fosters collaboration among academia, industry, and government to translate AI-powered geospatial intelligence into actionable sustainability outcomes.</p><p>Recent breakthroughs in artificial intelligence (AI) and cloud-native geospatial technologies are transforming how scientists monitor and model land surface characteristics. This proposed special issue of Remote Sensing of Environment, “Geospatial Foundation Models for Advancing Remote Sensing of Environment”, will highlight frontier developments in methods, datasets, and applications that leverage foundation models to interpret, classify, and detect Earth’s changing environment at various spatial and temporal scales.We invite contributions that explore the design, training, and application of various kinds of AI-driven geospatial foundation models, including but are not limited to AlphaEarth, Prithvi, TerraMind, OlmoEarth, Clay, Satlas Pretrain, to advance global and regional understanding of Earth’s surface’s characteristics and change processes. Topics of interest include but are not limited to:</p><ul>\n<li>Geospatial Foundation Model architectures and representation learning;</li>\n<li>Large-scale pretraining data curation, preprocessing, and validation frameworks;</li>\n<li>Embedding methods, similarity search, and retrieval-augmented analysis;</li>\n<li>Parameter-efficient fine-tuning, task adaptation, and domain generalization;</li>\n<li>Land Cover and Land Use Classification enabled by Foundation AI;</li>\n<li>Temporal modeling, automated pipelines, and continual learning for change detection and time series;</li>\n<li>Multimodal and cross-sensor Foundation Models integrating optical, SAR, multispectral, hyperspectral, text, and vector data;</li>\n<li>Uncertainty quantification, interpretability, and responsible use;</li>\n<li>Model compression, efficient inference, and scalable cloud or edge deployment;</li>\n<li>Applied studies demonstrating new scientific or operational insights using geospatial Foundation AI;</li>\n</ul>",
          "last_updated": "2026-02-08"
        },
        {
          "title": "Development, Validation, and Application of Medium- and High-Resolution Satellite Products at Regional to Global Scales",
          "url": "https://www.sciencedirect.com/special-issue/321741/development-validation-and-application-of-medium-and-high-resolution-satellite-products-at-regional-to-global-scales",
          "deadline": "28 February 2026",
          "guest_editors": "See website",
          "description": "",
          "last_updated": "2026-02-08"
        },
        {
          "title": "Remote sensing for assessing water-carbon coupling of terrestrial ecosystems",
          "url": "https://www.sciencedirect.com/special-issue/319332/remote-sensing-for-assessing-water-carbon-coupling-of-terrestrial-ecosystems",
          "deadline": "30 April 2026",
          "guest_editors": "Hongliang Ma<br>Benjamin Dechant German<br>Jiangyuan Zeng Aerospace Information Research<br>Aleixandre Verger Spanish National Research Council (CSIC)<br>William K. Smith<br>Youngryel Ryu<br>Seoul National",
          "description": "<p>Remote sensing techniques offer valuable capabilities for mapping biochemical and physical variables of the terrestrial ecosystems, including leaf area index (LAI), vegetation water, biomass, productivity, chlorophyll and fluorescence, temperature, transpiration, vegetation height and structure, soil moisture and evapotranspiration etc., along with dynamic ecosystem processes like phenology and disturbance events. These observations significantly advance our understanding of global water, carbon, and energy cycles. With dedicated efforts on recent satellite missions including SMOS, SMAP, Fengyun, ICESat-2, Sentinel-1/2/3, ECOSTRESS, Landsat-8/9, Gaofen, and the upcoming NISAR, BIOMASS, CIMR, FLEX, and SBG, there is an unprecedented opportunity for novel satellite products and improved mechanistic understanding and model representation of water-carbon coupling in terrestrial ecosystems. Moreover, improvements in the spatial, temporal, and spectral domains across these remote sensing techniques are enabling new insights into the resilience and resistance of ecosystems to climate change and changing disturbance regimes such as drought, heatwave, wildfire, and deforestation. In this background, the special issue aims to highlight pioneering advancements in remote sensing of ecohydrology, fostering the exchange of leading-edge research and ideas. Topics for this special issue include but are not limited to:</p><ul>\n<li>Review on state-of-the-art models, methods, products, and applications of remote sensing in ecohydrology;</li>\n<li>New algorithms and products from remote sensing observations for mapping biophysical and biochemical variables of terrestrial ecosystems related to carbon-water coupling;</li>\n<li>New applications of remote sensing in ecosystem processes and disturbances from regional to global scales;</li>\n<li>Coupling satellite remote sensing observations with ecosystem models (e.g., LPJ-GUESS, CLM, ORCHIDEE and P-model), focusing on the representation of coupled water and carbon cycling.</li>\n</ul>",
          "last_updated": "2026-02-08"
        },
        {
          "title": "Geostationary Ocean Color Remote Sensing Data for Improved Understanding of Surface Ocean Biogeochemistry",
          "url": "https://www.sciencedirect.com/special-issue/318780/geostationary-ocean-color-remote-sensing-data-for-improved-understanding-of-surface-ocean-biogeochemistry",
          "deadline": "31 July 2026",
          "guest_editors": "Jongkuk Choi<br>Director<br>Myungsook Park<br>Joseph Salisbury<br>Cara Wilson<br>Program<br>Hayley Evers-King<br>Marine applications expert",
          "description": "<p>Phytoplankton represent the fundamental basis of the ocean food web and through its diagenesis, phytoplankton contribute significantly to the stock of carbon in both dissolved and sedimentary phases. Given its importance, we submit that ocean color geostationary remote sensing can improve the capability to observe the temporal variability of phytoplankton and related geochemical properties of marine waters over diurnal, sub-seasonal, seasonal and interannual scales.</p><p>The first geostationary ocean color satellite, Geostationary Ocean Color Imager (GOCI) was launched in 2010 and has been widely used to monitor marine environments such as the TSM, CDOM, chlorophyll-a concentration, HAB, surface current movement and more (Hwang et al., 2022). GOCI-II was successfully launched in February 2020 as the successor of GOCI. Besides the local area in East Asia (Local Area mode), the GOCI sensors image the Pacific region (Full Disk mode) once a day. Inspired by the successful application of GOCI, the next geostationary ocean color satellite missions are scheduled to observe the coastal and marine waters in the Atlantic Ocean and coastal waters. For example, NASA is developing Geosynchronous Littoral Imaging and Monitoring Radiometer (GLIMR) and NOAA plans a three-satellite GeoXO (Geostationary Extended Observations) operational constellation with NASA.</p><p>A project on GOCI-II accuracy enhancement started in 2022, through which KIOST have been continuously collecting in-situ measurements for Cal/Val. The accuracies of Level-2 and Level-3 products are expected to be improved. To highlight the current technology and capability of the ocean color remote sensing at the geostationary orbit, we plan to publish a special issue on GOCI-II compiling the research results so far, the studies for developing GLIMR, GeoXO and experimental capacity from existing non-ocean colour Geostationary imagers (SEVIRI, FCI, GOES etc).Topics for this special issue include, but not limited to:</p><ul>\n<li>Recent advances in “typical” ocean color data products at various steps (atmospheric correction, Level 2 algorithms of various biogeochemical products, and Level 3 time series)</li>\n<li>Geostationary satellite application to HAB detection index, floating algae biomass, surface ocean currents, fluxes of SPM, POC, DOC, etc. along with its diurnal variations</li>\n<li>Deep/Machine-learning application for ocean color satellite retrievals</li>\n<li>Impacts of sensor calibration on ocean color products</li>\n<li>Validation of geostationary ocean color products with in situ observations in coastal waters and the data accuracy improvement</li>\n<li>Geostationary satellite applications to monitor and/or solve the diverse marine issues combined with other non-Geo sensors (EO. Microwave, Lidar, etc.) or geo-/bio- physical models</li>\n</ul>",
          "last_updated": "2026-02-08"
        }
      ]
    },
    {
      "name": "Cities",
      "url": "https://www.sciencedirect.com/journal/cities/about/call-for-papers",
      "image": "assets/images/cities.jpg",
      "special_issues": [
        {
          "title": "Pathways towards all-age friendly city regions",
          "url": "https://www.sciencedirect.com/special-issue/330210/pathways-towards-all-age-friendly-city-regions",
          "deadline": "30 June 2026",
          "guest_editors": "Yifan Yu<br>Ying Jin",
          "description": "<p>This special issue aims to build on the successful child-friendly and age-friendly initiatives, and develop a new, global dialogue among researchers who work on different population groups - of all ages, capacities and vulnerabilities. At a city-region level, this dialogue will help the researchers to connect their respective ideas and innovations across age groups, and forge a common agenda for city-region level policies and planning.</p><p>Since the turn of millennium, child-, elderly- and youth-friendly city initiatives have made important headways on a large number of countries. The policy actions have improved the wellbeing of the respectively targeted groups to various extent. Yet as the initiatives progressed, the interventions focusing upon specific groups have led to certain policy fragmentation, interdepartmental frictions and implementation gaps. It has come to a time to reflect, at a city scale, how to enhance coordination and synergy among all the initiatives and make the public resource allocation more effective. Such efforts have the potential to make cities more fair and just for all citizens.</p><p>The policy initiatives may also benefit from connecting to wider urban challenges. For example, a critical urban vulnerability that has not yet received sufficient investigation is the housing affordability of young adults in the world’s most prosperous cities. This worsening housing predicament impairs social mobility, family formation as well as access to jobs. This may lead to a further reduction of birth rates and in time, accelerating population ageing in those cities and worsening support for vulnerable groups.</p><p>Our working hypothesis is that urban communities that are better balanced with all population ages and diversities are likely to improve their productivity, quality of life and resilience. A shared perspective across population age groups will enable all citizens to better support one another and flourish together.</p><p>Special issue information:</p><p>We therefore call for colleagues from all related fields and all continents to contribute to this global dialogue. Research on the interplay and dynamics between and among generations would be one possible starting point. The contributors are encouraged to consider how their research insights are connected to practical policy actions, in line with the ethos of this journal.</p>",
          "last_updated": "2026-02-08"
        },
        {
          "title": "Evolution of urban spatial structure",
          "url": "https://www.sciencedirect.com/special-issue/329832/evolution-of-urban-spatial-structure",
          "deadline": "31 August 2027",
          "guest_editors": "BindongSun<br>Evert Meijers<br>Yan Song<br>Luca Salvati<br>Miquel-Angel Garcia-Lopez",
          "description": "<p>With more than half of the global population residing in urban areas since the 21st century, urbanization has become one of the most prominent phenomena worldwide. This process encompasses both the prosperity and decline of cities, manifesting in urban spatial structures as the concentration and dispersion of populations. As shifts in urbanization pathways affect infrastructure demand, land consumption, resource efficiency, carbon emissions, and neighborhood sustainability, understanding the spatial evolution of cities, along with its driving factors and outcomes, is fundamental to sustainable planning and governance.</p><p>The models of urban spatial change proposed by Hall (1971) and Van den Berg et al. (1982), divide the spatial cycle of cities into four sequential stages: urbanization, suburbanization, de-urbanization, and re-urbanization. These models provide the most influential frameworks for understanding the spatial dynamics of urban growth and decline, thereby informing urban policy. The frameworks have received considerable empirical support and have been substantially enriched by subsequent research. However, there remains substantial scope for further investigation. First, the classical models and subsequent empirical findings remain predominantly grounded in the European experience, calling for more extensive, particularly long-term, investigations in non-European contexts to enhance their theoretical transferability. Second, as regional imbalances persist, an increasing number of cities are entering the de-urbanization stage. Understanding the evolutionary trajectory and causes of shrinking cities is crucial for sustainable urban policies. Third, a growing array of external factors is influencing urban spatial evolution, including unforeseen events such as the COVID-19 pandemic, governmental interventions, and emerging technologies like informatization and artificial intelligence (AI). Assessing the extent to which these factors affect urban spatial evolution is essential for formulating future urban spatial governance policies. Fourth, beyond changes in urban population distribution, shifts in the spatial distribution of employment and their interaction with population patterns have emerged as critical concerns in urban spatial governance. Finally, the transformations in urban form resulting from urban spatial evolution are noteworthy, as different forms can lead to varying economic, social equity, and environmental consequences. For example, during suburbanization, whether population decentralization manifests as low-density sprawl or evolves into a polycentric structure remains a topic of debate.</p><p>To address the aforementioned issues, this special issue seeks innovative research on the evolution of urban spatial structures along with their driving factors and outcomes. The goal is to provide a robust foundation for formulating sustainable urban policies.</p><p>Bindong Sun </p><p>bdsun@zju.edu.cn</p><p>Evert Meijers </p><p>e.j.meijers@uu.nl </p><p>ys@email.unc.edu  </p><p>Luca Salvati </p><p>luca.salvati@uniroma1.it </p><p>Miquel-Angel Garcia-Lopez </p><p>miquelangel.garcia@uab.cat</p><p>Special issue information:</p><p>Potential topics for this special issue include, but are not limited to, the following:  </p><p>Emerging trends of urban spatial evolution and long-term spatial cycle of cities within/beyond European countries </p><p>Heterogeneity of urban spatial evolution between different types of cities </p><p>Causal mechanisms of urban spatial evolution, particularly in the context of de-urbanization and shrinking cities  </p><p>Exogenous forces shaping the evolution of urban spatial structure, including the COVID-19 pandemic, government intervention, information and communication technology (ICT), and artificial intelligence (AI) </p><p>Evolution of urban employment, and the link between employment and residential locations </p><p>Morphological change occurring during the process of urban spatial evolution and subsequent outcomes </p>",
          "last_updated": "2026-02-08"
        },
        {
          "title": "Quantum Computing and the City",
          "url": "https://www.sciencedirect.com/special-issue/328646/quantum-computing-and-the-city",
          "deadline": "31 October 2026",
          "guest_editors": "See website",
          "description": "<p>Quantum computing represents a profound shift beyond classical computation, harnessing superposition, entanglement, and quantum tunnelling to tackle complex urban challenges that conventional systems cannot efficiently address. Its emerging applications span core urban domains: quantum algorithms may deliver real-time optimisation of metropolitan transport networks; quantum simulation could enhance climate adaptation through high-resolution environmental modelling; and quantum methods offer new capabilities for managing dynamic energy grids and integrating distributed renewables. These advances create opportunities for cities for more robust, evidence-based infrastructure planning, resource allocation, and policy design. Beyond computation, quantum sensing supports improved environmental monitoring, quantum communication enhances infrastructure security, and quantum AI enables deeper insights from large-scale urban datasets. When integrated with digital twins, intelligent grids, and emergency response systems, these technologies raise important questions about governance, regulation, equity, and institutional readiness. This special issue seeks cutting-edge research on the conceptual, technical, practical, and policy intersections between quantum technologies and urban systems, positioning quantum innovations not only as computational breakthroughs but also as potential enablers and disruptors of more adaptive, efficient, equitable, and sustainable urban futures, while recognising the new risks and trade-offs they introduce.</p><p>Special issue information:</p><p>Emerging scholarship, e.g., Quantum AI Urbanism: Redefining the Future of Artificial Intelligence in Cities (Yigitcanlar et al., 2025), explores how next-generation computational paradigms may reshape urban technology, governance, and policy. Quantum computing marks a fundamental shift from classical bit-based logic by harnessing superposition, entanglement, and tunnelling to solve complex, large-scale problems that exceed conventional computational capacity. Potential applications span transport optimisation, fine-grained climate and environmental simulation, and integration of distributed renewables into dynamic energy grids. Combined with quantum sensing, quantum communication, and quantum machine learning, these capabilities open new possibilities for evidence-based urban planning, infrastructure management, and resilient policy design; while raising critical questions about governance, regulation, equity, and institutional preparedness.</p><p>This Special Issue, Quantum Computing and the City, invites cutting-edge research on full-stack quantum technologies (hardware, algorithms, sensing, communication), quantum-inspired optimisation and AI, and post-quantum cryptography—provided submissions demonstrate clear implications for urban systems, planning, policy, or governance. Purely technical papers without substantive urban relevance fall outside the scope. We welcome conceptual, theoretical, methodological, empirical, design-oriented, and policy-focused work using any methodological approach, including comparative, critical, and speculative studies grounded in urban concerns. All submissions must clearly articulate how the research advances understanding or practice in urban planning, design, governance, or management beyond generic smart-city or AI narratives.</p><p>The Special Issue aims to consolidate emerging knowledge and shape an international research agenda for quantum-enabled urbanism. By bridging urban studies, computer science, physics, engineering, and public policy, it seeks to:</p><ul>\n<li>Critically assess the promises, challenges, and limitations of quantum technologies for urban contexts.</li>\n</ul><ul>\n<li>Advance interdisciplinary understandings of quantum-enabled urbanism and its wider implications.</li>\n</ul><ul>\n<li>Showcase pioneering quantum AI applications, experimental implementations, and urban policy-relevant case studies.</li>\n</ul><ul>\n<li>Stimulate debate on responsible, ethical, and equitable deployment of quantum technologies in cities.</li>\n</ul><ul>\n<li>Develop a forward-looking roadmap for integrating quantum technologies into urban innovation, planning, and governance.</li>\n</ul><ul>\n<li>Explore the societal, economic, and environmental implications of quantum technologies for sustainable urban futures.</li>\n</ul><ul>\n<li>Foster collaboration between researchers, policymakers, and industry to accelerate practical and inclusive quantum urban solutions.</li>\n</ul>",
          "last_updated": "2026-02-08"
        },
        {
          "title": "The Politics of Spatial Inclusion in Cities",
          "url": "https://www.sciencedirect.com/special-issue/326521/the-politics-of-spatial-inclusion-in-cities",
          "deadline": "31 January 2026",
          "guest_editors": "See website",
          "description": "<p>Cities are made and remade through decisions about who may access, use, and shape space. This Special Issue examines the politics of spatial inclusion, how land use, design, location, visibility, mobility, and enforcement distribute opportunities and burdens across urban residents. Building on the “right to the city,” spatial justice, and the “just city,” we seek empirically grounded work that identifies concrete mechanisms of exclusion and inclusion and offers actionable pathways for more equitable governance and everyday practice. We welcome comparative and single city studies from across regions on housing and displacement; public space, safety, and gender; zoning, policing, and participation; platform/gig economies; youth and aging; climate risk and green gentrification; and data/AI for inclusive decision-making. The issue will open with a synthetic framing essay and assemble a curated set of original research articles advancing a rigorous, spatially informed agenda for inclusive cities.</p><p>Special issue information:</p><p>The nature of urban life and the potential for urban inclusion are conditioned by context and changing dynamics at various scales, from the global to the local. These include the dominance of (and efforts to contest) neoliberal urbanism, welfare state retrenchment, and the shifting division of labor between state and nonstate actors. They also include various impacts of (and pushback against) globalization, including migration, capital flows, climate change, technological innovation and diffusion, and increasing tendencies toward authoritarianism, isolationism, and the recalibration of transnational alliances.</p><p>At the local level, various forms of segregation are often central to the nature and dynamics of urban inclusion and exclusion, with disproportionate impact on vulnerable populations including the poor, ethnic and racial minorities, migrants, women and gender minorities, those with disabilities, youth, and the aged.</p><p>What we are looking for</p><p>Papers should demonstrate one or more of the following:</p>",
          "last_updated": "2026-02-08"
        },
        {
          "title": "Urban regeneration and mobility: Evolution and policy",
          "url": "https://www.sciencedirect.com/special-issue/321147/urban-regeneration-and-mobility-evolution-and-policy",
          "deadline": "31 May 2026",
          "guest_editors": "See website",
          "description": "<p>Special issue information:</p><p>Urban regeneration involves revitalising urban areas through modernising infrastructure, enhancing public spaces, and reorganising urban functions (Nachmany and Hananel, 2023). As a cornerstone of city planning, it mirrors broader economic, social, and spatial transformations. In today’s rapidly evolving cities, shaped by technological, societal, and economic changes, urban regeneration is deeply intertwined with mobility. Mobility not only connects people to opportunities but also plays a critical role in shaping the success of regeneration efforts by driving economic revitalisation, improving accessibility, and promoting social equity.</p><p>The intersection of urban regeneration and mobility presents both challenges and opportunities, requiring a nuanced understanding of complex urban dynamics. At the core is the imperative to enhance accessibility, ensuring equitable participation in a city’s economic, social, and cultural life for all residents, regardless of socioeconomic status (Jones and Lucas, 2012). Understanding the interplay between regeneration efforts and mobility systems is crucial for ensuring individuals can access essential resources and opportunities effectively (Smith, 2019). Moreover, mobility’s role in fostering social inclusion is increasingly critical, as accessibility barriers often deepen inequalities for marginalised communities (Lucas, 2019). Building resilient, sustainable, and equitable cities requires the seamless integration of mobility policies with regeneration strategies.</p><p>This special issue seeks to bring attention to how regeneration initiatives both influence and are influenced by mobility patterns in cities, with an emphasis on policy implications. It will delve into the ways which mobility systems—spanning public transport networks to active mobility solutions— interact with and shape urban regeneration projects. Moreover, as cities adapt to new challenges such as climate change, economic disparity, and social fragmentation, examining how urban regeneration can enhance or hinder mobility patterns, particularly for vulnerable populations, will be a key focus.</p><p>The special issue will focus on empirical and theoretical contributions that explore how urban regeneration and mobility evolve in tandem and the policy frameworks required to manage these changes. It will draw on examples from diverse urban contexts around the world, examining both developed and developing cities to provide a broad, comparative perspective on the issues at hand. By bringing together cutting-edge research, case studies, and policy analyses, this special issue will contribute to the broader dialogue on how cities can evolve in ways that are both sustainable and just, offering new perspectives on urban regeneration, mobility, and the future of urban living.</p><p>Potential topics include but are not limited to the following:</p><p>1. Evolution of urban regeneration and its relationship with mobility2. Social, economic, and environmental impacts of mobility on urban regeneration3. How mobility policies can influence the success of urban regeneration4. Spatial mobility patterns and their role in gentrification and displacement5. Mobility solutions for marginalized and low-income communities in regeneration zones6. Future trends in urban mobility and their implications for regeneration strategies</p>",
          "last_updated": "2026-02-08"
        }
      ]
    },
    {
      "name": "Building and Environment",
      "url": "https://www.sciencedirect.com/journal/building-and-environment/about/call-for-papers",
      "image": "assets/images/bae.jpg",
      "special_issues": [
        {
          "title": "Net Zero Carbon Built Environment 2",
          "url": "https://www.sciencedirect.com/special-issue/328735/net-zero-carbon-built-environment-2",
          "deadline": "01 December 2026",
          "guest_editors": "Yupeng Wu<br>Wangda Zuo<br>Xu Han<br>Yunyang Ye",
          "description": "<p>The intersection of climate resilience, societal transitions, and emerging technologies in the built environment has become a timely and globally relevant topic. Future built environments will face increasingly demanding challenges, requiring integrative and holistic approaches to all aspects affecting energy performance, comfort, and health. This Special Issue provides a platform for recent research and innovations aimed at achieving a net-zero carbon built environment, offering insights that support both scientific advancement and practical implementation.</p><p>1. Climate, Environment, and Society</p><ul>\n<li>Climate impacts: rising temperatures, wildfires, floods</li>\n<li>Resilient cities and infrastructure</li>\n<li>Regenerative landscapes and urban planning</li>\n<li>Low-carbon and energy-positive communities</li>\n<li>Health, wellbeing, and comfort</li>\n<li>Social equity, justice, and inclusive transitions</li>\n<li>Citizen science and participatory approaches</li>\n<li>Sustainable and inclusive mobility</li>\n</ul><ul>\n<li>Artificial intelligence in the built environment</li>\n<li>Digital transformation and smart design tools</li>\n<li>Renewable and low-carbon energy technologies</li>\n<li>Energy storage, hybrid systems, and integration</li>\n<li>Performance monitoring, digital twins, and operational outcomes</li>\n<li>Smart grids, energy flexibility, and management platforms</li>\n</ul>",
          "last_updated": "2026-02-08"
        },
        {
          "title": "Smart Ventilation and Low-carbon Buildings",
          "url": "https://www.sciencedirect.com/special-issue/328469/smart-ventilation-and-low-carbon-buildings",
          "deadline": "01 May 2026",
          "guest_editors": "Xianting Li<br>Dong Xie<br>Weirong Zhang<br>Chenhua Wang",
          "description": "<p>Since the establishment of the global carbon neutrality goal, the building sector—being a major contributor to energy consumption and carbon emissions—has been accelerating its transformation toward sustainability. Smart ventilation plays a pivotal role in this process by integrating energy efficiency, air quality improvement, and climate resilience into building design, operation, and performance evaluation. Its advancement relies on interdisciplinary research, technological innovation, energy management, policy support, and user behavior analysis. In addition, the rapid expansion of building stock, coupled with the growing impacts of climate change, heatwaves, and urban heat islands, has intensified challenges in ventilation and cooling. This situation has created a strong demand for new strategies and technologies. Addressing these challenges requires: the deep integration of ventilation and air purification; the development of next-generation systems that balance low-carbon and energy-saving objectives; innovations in simulation, testing, and evaluation methods; improvements in industrial ventilation and de-dusting efficiency; and enhanced understanding of building–microclimate interactions to achieve precise thermal comfort control. Moreover, interdisciplinary research linking ventilation, aerosols, and health, together with the adoption of digital and AI technologies, offers new opportunities for intelligent control and system optimization. This Special Issue, “Smart Ventilation and Low-Carbon Buildings,” aims to bring together cutting-edge research, technological innovations, and practical solutions to advance energy-efficient, healthy, and climate-adaptive buildings, ultimately supporting the global transition toward carbon neutrality.</p><p>The scope of the special issue includes the integration of ventilation and air purification, the development of next-generation systems that balance low-carbon and energy-saving objectives, innovations in simulation, testing, and evaluation methods, improvements in industrial ventilation and de-dusting efficiency, and enhanced understanding of building–microclimate interactions to achieve precise thermal comfort control. Moreover, interdisciplinary research linking ventilation, aerosols, and health, together with the adoption of digital and AI technologies, is also included.</p>",
          "last_updated": "2026-02-08"
        },
        {
          "title": "Urban Ecological Environment Evaluation Tool Development",
          "url": "https://www.sciencedirect.com/special-issue/327708/urban-ecological-environment-evaluation-tool-development",
          "deadline": "31 July 2026",
          "guest_editors": "Yupeng Wang<br>(Urban Climate<br>Hashem Akbari<br>(Urban Heat Island<br>Junqi Wang<br>(Urban Environmental Evaluation",
          "description": "<p>Because of the high population density and the increased urban energy consumption, anthropogenic heat and air pollution emissions from the building and transportation sectors have been evaluated for solution development. Low-carbon building design technology development could be considered for heat and air pollution emission reduction. This special issue focuses on the urban ecological environment, which includes the problems of urban heat island, urban energy, urban air quality, emissions and chemistry, urban vegetation and urban water. This special issue aims to develop related evaluation tools to support decision-making in urban policy, planning and design.</p><ul>\n<li>Urban environmental evaluation tool development</li>\n<li>Urban physics measurement and modeling</li>\n<li>Urban modeling and simulation in different scales</li>\n<li>Climate-neutral buildings and communities</li>\n<li>Urban heat island phenomenon evaluation</li>\n<li>Sustainable and innovative solutions and measures for mitigation of the urban heat island</li>\n<li>Big data and climate resilient city</li>\n<li>Urban anthropogenic heat emission and the outdoor environments</li>\n<li>Green buildings and their impacts on the urban environment</li>\n<li>Outdoor thermal comforts</li>\n</ul>",
          "last_updated": "2026-02-08"
        },
        {
          "title": "Low Carbon, High Comfort Integrated Lighting",
          "url": "https://www.sciencedirect.com/special-issue/326720/low-carbon-high-comfort-integrated-lighting",
          "deadline": "31 March 2026",
          "guest_editors": "Justyna Martyniuk-Peczek<br>Jan de Boer<br>David Geisler-Moroder<br>Natalia Giraldo Vasquez<br>Tao Luo<br>Barbara Matusiak<br>Eleanor Lee",
          "description": "<p>From a global perspective, lighting systems—when designed to be energy-efficient, digitally integrated, and intelligently managed—can play a key role in reducing carbon emissions while enhancing the functional and experiential quality of both indoor and urban spaces. The International Energy Agency’s SHC Task 70 / EBC Annex 90 “Low Carbon, High Comfort Integrated Lighting” is focused on implementing the full potential of lighting (electric, façade: daylighting &amp; passive solar) to achieve decarbonization while aligning with an integrative understanding of humans’ physiological and psychological needs for light. This Special Issue provides insights into the challenges and opportunities for Integrated Lighting within four core thematic areas: i) Low Carbon Lighting and Passive Solar; ii) Visual and non-visual User Requirements; iii) Digitized Lighting Solutions; iv) Lab and field study performance tracking. The SI includes contributions that span case studies, simulation-based research, methodological developments, and interdisciplinary reviews.</p><p>This Special Issue explores the potential of integrated lighting systems to contribute to global decarbonization goals while enhancing human comfort and well-being in the built environment. It is grounded in the ongoing IEA SHC Task 70 / EBC Annex 90 “Low Carbon, High Comfort Integrated Lighting”, which provides the research background and network for this initiative. The focus lies on general lighting systems for indoor environments and the interaction between buildings, their façades, and the urban context. It emphasizes lighting in non-domestic buildings and the integration of three complementary dimensions:</p><ol>\n<li>daylight utilization through advanced façade technologies and architectural solutions,</li>\n<li>electric lighting technologies and design strategies in the context of digitalization,</li>\n<li>control systems addressing both visual and non-visual user needs at the interface of daylight and electric lighting.</li>\n</ol><p>The Special Issue promotes a holistic approach to lighting that goes beyond energy efficiency to encompass life cycle assessment (LCA) and circular economy principles. It encourages contributions that support the transition from component-oriented perspectives to integrated, design-driven system solutions. Key themes include low-carbon lighting and passive solar strategies, user comfort and perception, digital lighting tools and processes, and application-oriented case studies demonstrating effective integration of technology, design, and operation.</p><p>Target audiences include researchers, building designers, consultants, industry professionals (lighting, façade, and software sectors), investors, and policy makers. The Special Issue aims to disseminate knowledge developed through the collaboration of numerous international research and practice centers, providing strategic, technical, and economic insights that help remove barriers to the identification, pursuit, and implementation of low-carbon lighting concepts and installations.</p>",
          "last_updated": "2026-02-08"
        }
      ]
    },
    {
      "name": "Computers, Environment and Urban Systems",
      "url": "https://www.sciencedirect.com/journal/computers-environment-and-urban-systems/about/call-for-papers",
      "image": "assets/images/ceus.jpg",
      "special_issues": [
        {
          "title": "Open Urban Data Science",
          "url": "https://www.sciencedirect.com/special-issue/322127/open-urban-data-science",
          "deadline": "31 May 2026",
          "guest_editors": "Filip Biljecki National<br>Martin Fleischmann Charles<br>Hugo Ledoux Delft<br>Geoff Boeing",
          "description": "<p>Computers, Environment and Urban Systems (CEUS) invites submissions for a special issue dedicated to Open Urban Data Science, with a particular focus on open software tools that enable innovative computer-based research on urban systems, systems of cities, and built and natural environments, emphasising the geospatial perspective. This special issue aims to recognise and promote the scholarly contributions represented by research software development at the urban scale.</p><p>We welcome contributions addressing, but not limited to:</p><ul>\n<li>Novel software tools for urban data collection, processing, visualisation, or analysis.</li>\n<li>Comprehensive platforms and frameworks that integrate multiple urban data sources.</li>\n<li>Methods for addressing privacy, equity, and ethics in urban data.</li>\n<li>Computational frameworks for urban simulation and modelling.</li>\n<li>Software for analysing urban mobility, morphology, accessibility, and transportation, and other domains relevant to the journal.</li>\n<li>Citizen science platforms for urban data collection and engagement.</li>\n</ul><p>Manuscripts should present original software tools, packages, or frameworks developed for urban data science applications. Submissions are expected to be comprehensive, including a literature review, information on software architecture, implementation details, availability, and elaborate examples demonstrating utility for research.</p><p>In addition to software papers, regular types of articles that are related to open urban data science are also welcome provided they demonstrate a strong connection to the theme of the special issue.</p><p>Evaluation criteria:</p><p>Submissions will be evaluated based on their relevance and alignment with the journal's scope, quality (e.g. robustness and reliability of the software), usability (e.g. comprehensive documentation, ease of use, and accessibility), significance (e.g. potential impact on research and practice), innovation (e.g. novelty of the software or methodological approach), and sustainability (e.g. maintenance, support, and adoption). The usual expectations from an academic article (e.g. including a state of the art literature review and articulation of scholarly contributions) apply.</p><p>All submissions must adhere to open science principles. The software must be released under an appropriate open-source license, be permanently available, and be free of restrictions on use.</p><p>For questions regarding this special issue, please contact the editors.</p><p>For examples of relevant papers, please see the following past publications in CEUS and related journals.</p><ul>\n<li>Boeing, G. (2017). OSMnx: New methods for acquiring, constructing, analyzing, and visualizing complex street networks. Computers, Environment and Urban Systems, 65, 126–139. https://doi.org/10.1016/j.compenvurbsys.2017.05.004</li>\n<li>Biljecki, F., &amp; Chow, Y. S. (2022). Global Building Morphology Indicators. Computers, Environment and Urban Systems, 95, 101809. https://doi.org/10.1016/j.compenvurbsys.2022.101809</li>\n<li>Danish, M., Labib, S., Ricker, B., &amp; Helbich, M. (2024). A citizen science toolkit to collect human perceptions of urban environments using open street view images. Computers, Environment and Urban Systems, 116, 102207. https://doi.org/10.1016/j.compenvurbsys.2024.102207</li>\n<li>Félix, R., Moura, F., &amp; Lovelace, R. (2024). Reproducible methods for modeling combined public transport and cycling trips and associated benefits: Evidence from the biclaR tool. Computers, Environment and Urban Systems, 117, 102230. https://doi.org/10.1016/j.compenvurbsys.2024.102230</li>\n<li>Ito et al. (2025). ZenSVI: An open-source software for the integrated acquisition, processing and analysis of street view imagery towards scalable urban science. Computers, Environment and Urban Systems, 119: 102283. https://doi.org/10.1016/j.compenvurbsys.2025.102283</li>\n<li>Mahajan, S. (2024). greenR: An open-source framework for quantifying urban greenness. Ecological Indicators, 163, 112108. https://doi.org/10.1016/j.ecolind.2024.112108</li>\n<li>Sevtsuk, A., &amp; Alhassan, A. (2025). Madina Python package: Scalable urban network analysis for modeling pedestrian and bicycle trips in cities. Journal of Transport Geography, 123, 104130. https://doi.org/10.1016/j.jtrangeo.2025.104130</li>\n</ul><p>Timeline:</p><p>Submissions are accepted until 31 May 2026.</p><p>Articles will be published on a rolling basis immediately after acceptance and production. The special issue containing an editorial will be released after all submissions are processed, sometime in 2027.</p><p>Software papers do not need to be anonymised and shall contain links to public repositories.</p><p>The journal’s submission platform (Editorial Manager) is now available for receiving submissions to this Special Issue. Please select the article type of “VSI: Open Urban Data Science” when submitting your manuscript online. The submission portal could be found on the Journal Homepage here: https://www.sciencedirect.com/journal/computers-environment-and-urban-systems</p><p>Check out the FAQs on special issues.</p><p>Learn more about the benefits of publishing in a special issue.</p><p>Interested in becoming a guest editor? Discover the benefits of guest editing a special issue and the valuable contribution that you can make to your field.</p><p>We use cookies that are necessary to make our site work. We may also use additional cookies to analyze, improve, and personalize our content and your digital experience. You can manage your cookie preferences using theCookie settings link. For more information, see ourCookie Policy</p><p>Cookie settings Accept only necessary cookies Accept all cookies</p><p>We use cookies which are necessary to make our site work. We may also use additional cookies to analyse, improve and personalise our content and your digital experience. For more information, see our Cookie Policy and the list of Google Ad-Tech Vendors.\n\n\nYou may choose not to allow some types of cookies. However, blocking some types may impact your experience of our site and the services we are able to offer. See the different category headings below to find out more or change your settings.\n\n</p><p>These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work.\n</p><p>These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.</p><p>These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site.</p><p>  Contextual Advertising Cookies </p><p>These cookies are used for properly showing banner advertisements on our site and associated functions such as limiting the number of times ads are shown to each user.</p>",
          "last_updated": "2026-02-08"
        },
        {
          "title": "Digital Twins and AI for Healthy and Sustainable Cities",
          "url": "https://www.sciencedirect.com/special-issue/320947/digital-twins-and-ai-for-healthy-and-sustainable-cities",
          "deadline": "30 November 2025",
          "guest_editors": "Nick Malleson<br>Alison Heppenstall<br>Mark Birkin<br>Jing Yao",
          "description": "<p>Urban areas worldwide are confronting multifaceted challenges, including climate change, health disparities, infrastructure demands, and the need for sustainable development. The urgency and complexity of these challenges has propelled urban analytics – an interdisciplinary field that develops data science and AI methods to study the processes, structures and interactions that drive cities – to the fore.</p><p>Digital Twins (DTs) and Artificial Intelligence (AI) are emerging as transformative tools in Urban Analytics research and policymaking, offering new ways to model, predict, and respond to urban dynamics. Their rapid proliferation in journals such as CEUS evidences an opportunity to redefine the mechanisms through which cities are conceptualised, simulated, and governed.</p><p>DTs, initially rooted in engineering and industrial applications, are gaining traction in urban domains such as urban energy management (Xu and Liu, 2024), sustainable built environments (Alibrandi, 2022), poor air quality mitigation (Topping et al., 2021) and improving urban transportation systems (Feng et al. 2023). At the same time, AI, and particularly advancements in large language models and geospatial foundation models, offers novel methodological pathways for geospatial analysis and decision support.</p><p>Despite this progress, substantive questions remain. These include: how to represent the demographic, economic, and social process in urban models; how to scale from the short time horizons associated with engineering applications to the yearly- or decade-long time horizons associated with social change; how to compartmentalise a city model from its surrounding social and physical structures; how to balance ethical and privacy challenges with the need for high-resolution data; etc. (Malleson et al. 2024).</p><p>This special issue aims to provide a critical interrogation of the role of DTs and AI in fostering healthy and sustainable cities in the context of significant environmental, social and economic challenges. By integrating perspectives from the disciplines that underpin urban analytics – computational modelling, urban planning, spatial science, public policy, etc. – this collection will assess the extent to which these emergent technologies can meaningfully address complex socio-environmental issues or whether they primarily function as sophisticated but ultimately constrained technological instruments.</p><p>We invite submissions that engage with, but are not limited to, the following thematic areas:</p><p>1. Theoretical and Methodological Foundations</p><p>o  Epistemological and ontological differences between digital twins and traditional urban simulation models</p><p>o  Embedding realistic behaviour in urban digital twins</p><p>o  Quantifying and understanding uncertainty in AI-informed digital twins</p><p>o  The integration of diverse urban datasets (e.g., mobility, air quality, social, etc.) into digital twins</p><p>2. Empirical Applications and Case Studies</p><p>o  The use of AI and digital twins to improve public health outcomes or to foster sustainable cities</p><p>o  The efficacy of urban digital twins for supporting evidenced-based urban policy and governance</p><p>o  Co-creation of AI and digital twins with citizens</p><p>3. Critical Challenges and Ethical Considerations</p><p>o  Data governance, representation biases, and the ethical ramifications of urban applications of AI and urban digital twins</p><p>o  The role of digital twins and AI in reinforcing existing urban power structures and governance paradigms</p><p>o  Policy and regulatory frameworks required for responsible and equitable adoption of AI-driven urban analytics</p><p>o  Transparent and explainable digital twins</p><p>4. Future Trajectories and Emerging Research Frontiers</p><p>o  The potential for geospatial foundation models to redefine urban AI applications</p><p>o  Scaling from parsimonious toys to full city/regional applications</p><p>o  Integrating AI, digital twins, and agent-based modelling</p><p>o  Real-time data-assimilation in digital twins</p><p>o  The integration of large-language models or geospatial foundation models for more advanced, human-centred digital twins</p>",
          "last_updated": "2026-02-08"
        }
      ]
    }
  ]
}